app/controllers/hunts_controller.rb

  def index
    @user = current_user
    #@player = Player.find :all, :conditions => { :user_id => current_user.id }

    @playerhunts = @user.hunts
    @hunts =  Hunt.find :all, :conditions => { :created_by => current_user.login}
---
SELECT * FROM "hunts"

  def show
    @users = User.find :all, :conditions => { :creator => false}
    @hunt = Hunt.find(params[:id])
---
SELECT * FROM "hunts" WHERE ("hunts"."id" = 1)

  def edit
    @hunt = Hunt.find(params[:id])
---
SELECT * FROM "hunts" WHERE ("hunts"."id" = 1)

  def create
    @hunt = Hunt.new(params[:hunt])
    @hunt.created_by = current_user.login
---
INSERT INTO "hunts" ("name", "updated_at", "end", "description", "start", "created_at", "location") VALUES('Haha hunt', '2009-02-03 07:02:36', NULL, 'learn about wildflowers!', NULL, '2009-02-03 07:02:36', 'Brisbane')