app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "activated_at", "crypted_password", "deleted_at", "remember_token_expires_at", "activation_code", "remember_token", "login", "email", "created_at", "state") VALUES('aa3d54234fe28dde1a4229c11405df247a224040', '2009-01-25 12:40:26', NULL, '5e78ec74be41110fe01b78c3a59587b457b41eac', NULL, NULL, 'f5b8d90a4444127581b12ff91eb40a40cdded69b', NULL, 'Riblah', 'lilacparrot@gmail.com', '2009-01-25 12:40:26', 'pending')
---
  def create
    logout_keeping_session!

    @user = User.new(params[:user])
    @user.creator = !!params[:user][:creator]

    success = @user && @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
      @user = User.find(params[:id])